; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	thermograph1 - mode
	image2 - mode
	infrared0 - mode
	Star2 - direction
	Star1 - direction
	GroundStation0 - direction
	Star3 - direction
	Planet4 - direction
	Star5 - direction
	Planet6 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 161)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star1)
	(supports instrument2 thermograph1)
	(supports instrument2 image2)
	(calibration_target instrument2 Star2)
	(supports instrument3 image2)
	(calibration_target instrument3 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet6)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 195)
	(supports instrument4 image2)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 infrared0)
	(supports instrument5 image2)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 199)
	(= (data Star3 thermograph1) 71)
	(= (data Planet4 thermograph1) 11)
	(= (data Star5 thermograph1) 201)
	(= (data Planet6 thermograph1) 182)
	(= (data Star3 image2) 129)
	(= (data Planet4 image2) 176)
	(= (data Star5 image2) 253)
	(= (data Planet6 image2) 132)
	(= (data Star3 infrared0) 179)
	(= (data Planet4 infrared0) 110)
	(= (data Star5 infrared0) 96)
	(= (data Planet6 infrared0) 224)
	(= (slew_time Star2 GroundStation0) 41)
	(= (slew_time GroundStation0 Star2) 41)
	(= (slew_time Star2 Star1) 54.42)
	(= (slew_time Star1 Star2) 54.42)
	(= (slew_time Star1 GroundStation0) 4.97)
	(= (slew_time GroundStation0 Star1) 4.97)
	(= (slew_time Star3 GroundStation0) 8.866)
	(= (slew_time GroundStation0 Star3) 8.866)
	(= (slew_time Star3 Star1) 28.43)
	(= (slew_time Star1 Star3) 28.43)
	(= (slew_time Star3 Star2) 30.97)
	(= (slew_time Star2 Star3) 30.97)
	(= (slew_time Planet4 GroundStation0) 4.32)
	(= (slew_time GroundStation0 Planet4) 4.32)
	(= (slew_time Planet4 Star1) 53)
	(= (slew_time Star1 Planet4) 53)
	(= (slew_time Planet4 Star2) 20.09)
	(= (slew_time Star2 Planet4) 20.09)
	(= (slew_time Planet4 Star3) 50.28)
	(= (slew_time Star3 Planet4) 50.28)
	(= (slew_time Star5 GroundStation0) 12.6)
	(= (slew_time GroundStation0 Star5) 12.6)
	(= (slew_time Star5 Star1) 55.43)
	(= (slew_time Star1 Star5) 55.43)
	(= (slew_time Star5 Star2) 7.706)
	(= (slew_time Star2 Star5) 7.706)
	(= (slew_time Star5 Star3) 47.55)
	(= (slew_time Star3 Star5) 47.55)
	(= (slew_time Star5 Planet4) 1.951)
	(= (slew_time Planet4 Star5) 1.951)
	(= (slew_time Planet6 GroundStation0) 38.43)
	(= (slew_time GroundStation0 Planet6) 38.43)
	(= (slew_time Planet6 Star1) 59.38)
	(= (slew_time Star1 Planet6) 59.38)
	(= (slew_time Planet6 Star2) 32.47)
	(= (slew_time Star2 Planet6) 32.47)
	(= (slew_time Planet6 Star3) 39.42)
	(= (slew_time Star3 Planet6) 39.42)
	(= (slew_time Planet6 Planet4) 17.8)
	(= (slew_time Planet4 Planet6) 17.8)
	(= (slew_time Planet6 Star5) 20.48)
	(= (slew_time Star5 Planet6) 20.48)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Star3 thermograph1)
	(have_image Star5 infrared0)
	(have_image Planet6 image2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite2 planet4 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 199 to 148.72, (fuel-used) from 0 to 50.28
   goals met: 0 of 3
2. (turn_to satellite2 groundstation0 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 148.72 to 144.4, (fuel-used) from 50.28 to 54.6
   goals met: 0 of 3
3. (turn_to satellite2 planet4 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 144.4 to 140.08, (fuel-used) from 54.6 to 58.92
   goals met: 0 of 3
4. (turn_to satellite2 groundstation0 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 140.08 to 135.76, (fuel-used) from 58.92 to 63.24
   goals met: 0 of 3
5. (turn_to satellite2 planet4 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 135.76 to 131.44, (fuel-used) from 63.24 to 67.56
   goals met: 0 of 3
6. (turn_to satellite2 groundstation0 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 131.44 to 127.12, (fuel-used) from 67.56 to 71.88
   goals met: 0 of 3
7. (turn_to satellite2 planet4 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 127.12 to 122.8, (fuel-used) from 71.88 to 76.2
   goals met: 0 of 3
8. (turn_to satellite2 groundstation0 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 122.8 to 118.48, (fuel-used) from 76.2 to 80.52
   goals met: 0 of 3
9. (turn_to satellite2 planet4 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 118.48 to 114.16, (fuel-used) from 80.52 to 84.84
   goals met: 0 of 3
10. (turn_to satellite2 star3 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 114.16 to 63.88, (fuel-used) from 84.84 to 135.12
   goals met: 0 of 3
11. (turn_to satellite2 groundstation0 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 63.88 to 55.014, (fuel-used) from 135.12 to 143.986
   goals met: 0 of 3
12. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 3
13. (turn_to satellite2 star3 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 star3)
   changed: (fuel satellite2) from 55.014 to 46.148, (fuel-used) from 143.986 to 152.852
   goals met: 0 of 3
14. (turn_to satellite2 groundstation0 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 46.148 to 37.282, (fuel-used) from 152.852 to 161.718
   goals met: 0 of 3
15. (calibrate satellite2 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 0 of 3
16. (switch_off instrument5 satellite2)
   deleted: (power_on instrument5)
   added: (power_avail satellite2)
   goals met: 0 of 3
17. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 3
18. (calibrate satellite2 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 0 of 3
19. (switch_off instrument4 satellite2)
   deleted: (power_on instrument4)
   added: (power_avail satellite2)
   goals met: 0 of 3
20. (turn_to satellite2 planet4 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 37.282 to 32.962, (fuel-used) from 161.718 to 166.038
   goals met: 0 of 3
21. (turn_to satellite2 groundstation0 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 32.962 to 28.642, (fuel-used) from 166.038 to 170.358
   goals met: 0 of 3
22. (turn_to satellite2 planet4 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 28.642 to 24.322, (fuel-used) from 170.358 to 174.678
   goals met: 0 of 3
23. (turn_to satellite2 groundstation0 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 24.322 to 20.002, (fuel-used) from 174.678 to 178.998
   goals met: 0 of 3
24. (turn_to satellite2 planet4 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 20.002 to 15.682, (fuel-used) from 178.998 to 183.318
   goals met: 0 of 3
25. (turn_to satellite1 groundstation0 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 195 to 156.57, (fuel-used) from 183.318 to 221.748
   goals met: 0 of 3
26. (turn_to satellite2 star5 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 star5)
   changed: (fuel satellite2) from 15.682 to 13.731, (fuel-used) from 221.748 to 223.699
   goals met: 0 of 3
27. (switch_on instrument4 satellite2)
   deleted: (calibrated instrument4) (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 3
28. (switch_off instrument4 satellite2)
   deleted: (power_on instrument4)
   added: (power_avail satellite2)
   goals met: 0 of 3
29. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 3
30. (turn_to satellite1 star1 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 156.57 to 151.6, (fuel-used) from 223.699 to 228.669
   goals met: 0 of 3
31. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 0 of 3
32. (turn_to satellite1 planet6 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 151.6 to 92.22, (fuel-used) from 228.669 to 288.049
   goals met: 0 of 3
33. (turn_to satellite0 planet4 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 161 to 156.68, (fuel-used) from 288.049 to 292.369
   goals met: 0 of 3
34. (turn_to satellite0 groundstation0 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 156.68 to 152.36, (fuel-used) from 292.369 to 296.689
   goals met: 0 of 3
35. (turn_to satellite0 planet4 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 152.36 to 148.04, (fuel-used) from 296.689 to 301.009
   goals met: 0 of 3
36. (turn_to satellite0 groundstation0 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 148.04 to 143.72, (fuel-used) from 301.009 to 305.329
   goals met: 0 of 3
37. (turn_to satellite0 planet4 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 143.72 to 139.4, (fuel-used) from 305.329 to 309.649
   goals met: 0 of 3
38. (turn_to satellite0 groundstation0 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 139.4 to 135.08, (fuel-used) from 309.649 to 313.969
   goals met: 0 of 3
39. (turn_to satellite0 star3 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 135.08 to 126.214, (fuel-used) from 313.969 to 322.835
   goals met: 0 of 3
40. (switch_on instrument5 satellite2)
   deleted: (calibrated instrument5) (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 3
41. (turn_to satellite2 planet4 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 13.731 to 11.78, (fuel-used) from 322.835 to 324.786
   goals met: 0 of 3
42. (turn_to satellite2 groundstation0 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 11.78 to 7.46, (fuel-used) from 324.786 to 329.106
   goals met: 0 of 3
43. (calibrate satellite2 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 0 of 3
44. (turn_to satellite2 planet4 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 7.46 to 3.14, (fuel-used) from 329.106 to 333.426
   goals met: 0 of 3
45. (turn_to satellite2 star5 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 star5)
   changed: (fuel satellite2) from 3.14 to 1.189, (fuel-used) from 333.426 to 335.377
   goals met: 0 of 3
46. (turn_to satellite0 star2 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 126.214 to 95.244, (fuel-used) from 335.377 to 366.347
   goals met: 0 of 3
47. (turn_to satellite0 star3 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 95.244 to 64.274, (fuel-used) from 366.347 to 397.317
   goals met: 0 of 3
48. (take_image satellite2 star5 instrument5 infrared0)
   added: (have_image star5 infrared0)
   changed: (data_capacity satellite2) from 1000 to 904, (data-stored) from 0 to 96
   goals met: 1 of 3
49. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 3
50. (turn_to satellite0 star2 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 64.274 to 33.304, (fuel-used) from 397.317 to 428.287
   goals met: 1 of 3
51. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 1 of 3
52. (turn_to satellite0 star3 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 33.304 to 2.334, (fuel-used) from 428.287 to 459.257
   goals met: 1 of 3
53. (take_image satellite0 star3 instrument0 thermograph1)
   added: (have_image star3 thermograph1)
   changed: (data_capacity satellite0) from 1000 to 929, (data-stored) from 96 to 167
   goals met: 2 of 3
54. (take_image satellite1 planet6 instrument3 image2)
   added: (have_image planet6 image2)
   changed: (data_capacity satellite1) from 1000 to 868, (data-stored) from 167 to 299
   goals met: 3 of 3
